First we need to import stuff. Remember that you may need to install numpy, pandas, sklearn and possibly other packages

In [1]:
import pandas as pd

from sklearn import tree
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.neighbors import KNeighborsClassifier
from sklearn import svm

Loading the data is just reading the CSV. Also use the read_csv method as CSV is a complicated format and you do not want to parse it yourself...

In [2]:
tbl = pd.read_csv("train.csv")
tbl.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Lets clean up the data. You can do anything here (remove columns, fill NA values and more)

In [3]:
tbl.fillna(0, inplace=True)

Lets create the X and Y data for the project. Separate the "Survived" column out

In [4]:
X = tbl.drop(
    ["Survived"],
    axis=1,
)

Y = tbl[["Survived"]]

Now lets look at X, it should have all the columns but not "Survived"

In [5]:
X.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,0,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,0,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,0,S

Lets look at Y, it should only have the "Survived" column

In [6]:
Y.head()

   Survived
0         0
1         1
2         1
3         1
4         0

Lets convert X and Y to python and not pandas data structures so that we could feed them into sklearn

In [7]:
X = pd.get_dummies(X)
Y = pd.get_dummies(Y)

Lets split the data into test and train

In [8]:
X_train, X_test, y_train, y_test = train_test_split(X, Y)
len(X_train), len(X_test), len(y_train), len(y_test)

(668, 223, 668, 223)

Lets create a machine learning algorithm object

In [9]:
alg = tree.DecisionTreeClassifier()
type(alg)

sklearn.tree.tree.DecisionTreeClassifier

lets train the classifier, the result of training is held in the object itself. The result is the algorithm object itself.

In [10]:
alg.fit(X_train, y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [11]:
score = alg.score(X_test, y_test)
score

0.7982062780269058